Revit 2026 API

# CurveLoopTransform Method

---

Transforms this curve loop and all of its component curves by the supplied transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Transform(
	Transform transform
)
```
```vb
Public Sub Transform (
	transform As Transform
)
```
```cpp
public:
void Transform(
	Transform^ transform
)
```
```fsharp
member Transform :
        transform : Transform -> unit
```

#### Parameters

transform Transform
     The transformation.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | transform is not conformal. -or- transform has a scale that is negative or zero. |

The modified CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming that the curves were contiguous in the input curve loop).

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace